#Lecture4_Task3
#3.	Დაწერეთ პროგრამა რომელიც მიიღებს მთელ დადებით რიცხვს.
# Პროგრამამ უნდა იპოვოს და ეკრანზე ერთ ხაზზე დაბეჭდოს ამ რიცხვის ყველა გამყოფი.
# 0 < n < 1000. Მაგალითად:
# Enter number: 18
# 1 2 3 6 9 18
#თუ მარტო result.add(i) მექნებოდა, მაშინ მომცემდა გამყოფებს,თვითონ ამ რიცხვის, როგორც გამყოფის გამოტოვებით,
# რადგან i ადგენს გამყოფების ზედა ზღვარს და არის თავად ამ რიცხვზე ნაკლები - კვადრატული ფესვს +1 იდან გამომდინარე,
#თავად რიცხვის, როგორც გამყოფის დასამატებლად მჭირდება ფუნქცია result.add(n // i),რომელიც 1ზე გაყოფით (1 შედის რეინჯში)
# მომცემს ამ რიცხვს
# def divisions else statemens ვერ გადავაბი :(

n=int(input("Please, enter an integer between 0 and 1000:"))
def divisors(n):
    result = set()
    for i in range(1, int(n ** 0.5) + 1):
        if n % i == 0:
           result.add(i)
           result.add(n // i)
    return list(result)
print(divisors(n))
